Revit 2027 API
PropertyTableEntryCurveType Enumeration
 An enumerated type that represents the curve types supported in a table entry for a PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PropertyTableEntryCurveType
Public Enumeration PropertyTableEntryCurveType
public enum class PropertyTableEntryCurveType
type PropertyTableEntryCurveType
Members
Member name | Value | Description
Arc | 1 |  An Arc
Line | 0 |  A Line
See Also
Reference
Autodesk.Revit.DB Namespace